package Lesson_04r;

public class Tasks {

    // Class work:

        /*
        1. Повторите содержание класса StringExample (видео к уроку - 00:09:32)

        2. В классе MethodExample реализуйте методы:
                increasser (int a, int index) который будет увеличивать параметр a на значение index.

        3. Повторите класс PracticeExample с занятия (видео 1:00:20).
         */

   // Home work:

        /*

        1. Метод на конкатенацию строк.

            Написать метод, который будет принимать три параметра String типа и возвращать
            результат их конкатенации. Название метода - ooncat. Метод должен содержаться в классе.
            Название класса не имеет значения.

        2.   Кратные на промежутке.

             Напишите метод, который на промежутке [a, b] будет находить количество чисел, которые
             кратны числу n. Сигнатура метода: findDivCount (short a, short b, int n). n>0. 0<=a<=b.

        3.  Сравнение сумм.

            Напишите метод, который будет сравнивать сумму чисел на промежутках [a, b], [c, d] включительно
            и возвращать true если первая сумма больше, и false в другом случае.
            Сигнатура метода - compareSums (int a, int b, int c, int d). Для нахождения суммы напишите
            отедльный метод sum (int from, int to), который будете потом использовать.
            Метод должен содержаться в классе. Название класса не важно.

         */
}
